ГТС/УТГТС/Documents/ЗаявкаНаВывоз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВывоз</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КудаЕдет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаЗабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВывоза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаТранспорт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоловинаДня</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесПоДокументам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаВывоз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратыНаМашину</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВывоза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Собирается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыЗаявокНаВывоз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаВывоз</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСогласованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыЗаявокНаТранспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаТранспорт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Documents/ЗаявкаНаВывоз/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
		
	КонецЕсли; 
	Объект.СтатусСклада=Перечисления.СтатусыЗаявокНаВывоз.НеПодтверждено;
	Если НЕ (РольДоступна("ASP_УправлениеЗаявкамиНаВывоз") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		Элементы.ДокументыВзятьВРаботу.Видимость=ложь; 
		
	КонецЕсли;
	ДатаГрафика=ПолучитьСледующийРабочийДень();
	Если ЗначениеЗаполнено(Объект.Ссылка) и 
		//НачалоДня(Объект.ДатаВывоза)<=ДатаГрафика И ТекущаяДата()>ДатаГрафика-60*60*8 И 
		ЗначениеЗаполнено(Объект.ДатаВывоза) И НЕ РольДоступна("ASP_УправлениеЗаявкамиНаВывоз") Тогда
		Элементы.ДатаВывоза.ТолькоПросмотр=Истина;
	КонецЕсли;
	//Вес = ПересчитатьВес();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	если НЕ 
		(РольДоступна("ASP_УправлениеЗаявкамиНаВывоз") ИЛИ РольДоступна("ПолныеПрава")) и НЕ Параметры.Ключ.Пустая() Тогда
		ДатаГрафика=ПолучитьСледующийРабочийДень();     
		Если (НачалоДня(Объект.ДатаВывоза)<=ДатаГрафика И ТекущаяДата()>ДатаГрафика-60*60*8) ИЛИ (ТекущаяДата()>НачалоДня(Объект.ДатаВывоза)-60*60*8) Тогда
			
			Элементы.Документы.ТолькоПросмотр=Истина;
			Элементы.Документы.КоманднаяПанель.Видимость=Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если (РольДоступна("ASP_УправлениеЗаявкамиНаВывоз") ИЛИ РольДоступна("ПолныеПрава"))  Тогда
		Элементы.СтатусСклада.ТолькоПросмотр=Ложь;
		Элементы.ТранспортныеЗатраты.Видимость=Истина;
	КонецЕсли;                                       
	
	//Добавлено 27.04.2025
	Если НЕ ЗначениеЗаполнено(Объект.СкладВывоза) Тогда
		Объект.СкладВывоза=Справочники.Склады.НайтиПоНаименованию("Склад временного хранения г.ТАЛДОМ",Истина,,);
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		ГиперссылкаФайлов = МодульРаботаСФайлами.ГиперссылкаФайлов();
		ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
		МодульРаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриИзменении(Элемент)
	
	//Вес = ПересчитатьВес();
	Объект.ВесПоДокументам=ПересчитатьВес();
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьВес();
	тз = Объект.Документы.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тз.Документ КАК Документ
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&тз КАК тз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Документ КАК Документ
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("тз", тз);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ЗаявкаНаВывозДокументы.Документ КАК Документ
	//|ИЗ
	//|	Документ.ЗаявкаНаВывоз.Документы КАК ЗаявкаНаВывозДокументы
	//|ГДЕ
	//|	ЗаявкаНаВывозДокументы.Ссылка В (&Ссылка)";
	//Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	СписокДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Документ");
	
	
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ТоварыКОтгрузке.КОтгрузке) КАК Количество,
	|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыКОтгрузке.Номенклатура.ВесЗнаменатель, 1) > 0
	|			ТОГДА ТоварыКОтгрузке.Номенклатура.ВесЧислитель / ЕСТЬNULL(ТоварыКОтгрузке.Номенклатура.ВесЗнаменатель, 1)
	|		ИНАЧЕ ТоварыКОтгрузке.Номенклатура.ВесЧислитель
	|	КОНЕЦ КАК Вес
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|ГДЕ
	|	ТоварыКОтгрузке.Регистратор В(&СписокДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОтгрузке.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыКОтгрузке.Номенклатура.ВесЗнаменатель, 1) > 0
	|			ТОГДА ТоварыКОтгрузке.Номенклатура.ВесЧислитель / ЕСТЬNULL(ТоварыКОтгрузке.Номенклатура.ВесЗнаменатель, 1)
	|		ИНАЧЕ ТоварыКОтгрузке.Номенклатура.ВесЧислитель
	|	КОНЕЦ";
	
	Запрос1.УстановитьПараметр("СписокДокументов", СписокДокументов);
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	
	ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
	Вес = 0;
	Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
		Вес = Вес+ВыборкаДетальныеЗаписи1.Вес*ВыборкаДетальныеЗаписи1.Количество;
	КонецЦикла;
	Возврат Вес;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ВесПоДокументам=ПересчитатьВес();
	Объект.ВесПоДокументам=ПересчитатьВес();
	если НЕ 
		(РольДоступна("ASP_УправлениеЗаявкамиНаВывоз") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		Отказ = ПроверитьДокументы(Объект.Документы.Выгрузить(,"Документ"));
		ДатаГрафика=ПолучитьСледующийРабочийДень();
		ТестоваяДата=ДатаГрафика-60*60*8;
		Если (НачалоДня(Объект.ДатаВывоза)<=ДатаГрафика И ТекущаяДата()>ДатаГрафика-60*60*8) ИЛИ (ТекущаяДата()>НачалоДня(Объект.ДатаВывоза)-60*60*8) Тогда
			Сообщить("Заявку нельзя менять позднее 16.00 дня накануне вывоза");
			Отказ = Истина;
		КонецЕсли; 
		Если  НЕ 
			(РольДоступна("ASP_УправлениеЗаявкамиНаВывоз") ИЛИ РольДоступна("ПолныеПрава")) И ПолучитьВесУжеСуществующихЗаявок(Объект.ДатаВывоза)+?(Объект.Ссылка.Пустая(),Объект.Вес,0)>61000 
			Тогда Отказ = Истина;  
			Сообщить("На данный период нельзя записать более 60 тонн для вывоза, свяжитесь с ответственным по складу или скорректируйте количество и вес вывозимого товара.");
		Иначе    
		КонецЕсли;
	Иначе  
		если НЕ Объект.Статус=Перечисления.СтатусыЗаявокНаТранспорт.Отменено Тогда
			Отказ = ПроверитьДокументы(Объект.Документы.Выгрузить(,"Документ"));
		КонецЕсли;
	Конецесли;
	//
	//Отказ = ПроверитьДокументы(Объект.Документы.Выгрузить(,"Документ"));
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументы(ДокументыЗаявки);
	если ДокументыЗаявки.Количество()>0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаВывозДокументы.Документ КАК Документ
		|ИЗ
		|	Документ.ЗаявкаНаВывоз.Документы КАК ЗаявкаНаВывозДокументы
		|ГДЕ
		|	ЗаявкаНаВывозДокументы.Документ В(&Документы)
		|	И ЗаявкаНаВывозДокументы.Ссылка <> &Ссылка
		|	И ЗаявкаНаВывозДокументы.Ссылка.Статус = &Статус";
		
		Запрос.УстановитьПараметр("Документы", ДокументыЗаявки);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаявокНаТранспорт.КВыполнению);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			сообщить("Нельзя один документ отгрузки привязывать к нескольким заявкам на вывоз, если они имеют статус к выполнению.");
			Возврат Истина;
		КонецЦикла;
		
		Возврат ложь;
	Иначе
		Возврат ложь;
	КонецЕсли
	
КонецФункции

Функция ПолучитьВесУжеСуществующихЗаявок(ДатаВывоза)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЗаявкаНаВывоз.Вес) КАК Вес,
	|	НАЧАЛОПЕРИОДА(ЗаявкаНаВывоз.ДатаВывоза, ДЕНЬ) КАК ДатаВывоза
	|ИЗ
	|	Документ.ЗаявкаНаВывоз КАК ЗаявкаНаВывоз
	|ГДЕ
	|	ЗаявкаНаВывоз.ДатаВывоза = &ДатаВывоза
	|	И ЗаявкаНаВывоз.Ссылка <> &Ссылка
	|	И ЗаявкаНаВывоз.Статус = &Статус
	|	И ЗаявкаНаВывоз.Проведен = ИСТИНА
	|	И ЗаявкаНаВывоз.СтатусСклада <> &СтатусСклада
	|	И ЗаявкаНаВывоз.СкладВывоза = &СкладВывоза
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаВывоз.ДатаВывоза";
	
	Запрос.УстановитьПараметр("ДатаВывоза", НачалоДня(ДатаВывоза));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка); 
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаявокНаТранспорт.КВыполнению); 
	Запрос.УстановитьПараметр("СтатусСклада", Перечисления.СтатусыЗаявокНаВывоз.Отменено);
	Запрос.УстановитьПараметр("СкладВывоза", Справочники.Склады.НайтиПоНаименованию("Склад временного хранения г.ТАЛДОМ",Истина,,));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СуммаВесаДляВывоза=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаВесаДляВывоза=СуммаВесаДляВывоза+ВыборкаДетальныеЗаписи.Вес;
	КонецЦикла;
	Возврат СуммаВесаДляВывоза;
	
КонецФункции

&НаСервере
Процедура ВзятьВРаботуНаСервере()
	Для каждого Стр из Объект.Документы Цикл
		Если НЕ значениезаполнено(Стр.Документ.ПринятоВРаботу) тогда
			ДокОбъект = Стр.Документ.ПолучитьОбъект();
			ДокОбъект.ПринятоВРаботу = текущаядата();
			ДокОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ВзятьВРаботу(Команда)
	ВзятьВРаботуНаСервере();
	сообщить("Взятие в работу заявки "+ Объект.Номер + " выполнено");
КонецПроцедуры


&НаСервере
Функция ПроверитьОтгрузку(Документ)
	Если ЗначениеЗаполнено(Документ.ОтметкаСклада) Тогда
		Возврат Истина;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ДокументыДокументПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Документы.ТекущиеДанные;
	Если ПроверитьОтгрузку(ТекущаяСтрока.Документ)=Истина тогда
		сообщить("документ уже отгружен складом");
		Объект.Документы.Удалить(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЗначениеЯчейки=Элемент.ТекущиеДанные.Документ;
	если ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
		ОткрытьЗначение(ЗначениеЯчейки);
	Иначе
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Объект.Документы.Добавить().Документ= ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовПеремещения(Команда)
	ОткрытьФорму(
	"Документ.ПеремещениеТоваров.ФормаВыбора", 
	Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", 
	Ложь, Истина), 
	ЭтаФорма
	, , , ,
	//Новый ОписаниеОповещения(
	//	"ПриЗакрытииФормыПодбора", 
	//	ЭтаФорма, 
	//	"Подбор")
	, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументовРеализации(Команда)
	ОткрытьФорму(
	"Документ.РеализацияТоваровУслуг.ФормаВыбора", 
	Новый Структура("ЗакрыватьПриВыборе, РежимВыбора", 
	Ложь, Истина), 
	ЭтаФорма
	, , , ,
	//Новый ОписаниеОповещения(
	//	"ПриЗакрытииФормыПодбора", 
	//	ЭтаФорма, 
	//	"Подбор")
	, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСледующийРабочийДень()
	Запрос1 = Новый Запрос;
	Запрос1.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	КалендарныеГрафики.Календарь,
	|	КалендарныеГрафики.Год,
	|	КалендарныеГрафики.ДатаГрафика,
	|	КалендарныеГрафики.ДеньВключенВГрафик,
	|	КалендарныеГрафики.КоличествоДнейВГрафикеСНачалаГода
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|ГДЕ
	|	КалендарныеГрафики.ДеньВключенВГрафик
	|	И КалендарныеГрафики.ДатаГрафика > &ДатаГрафика";
	Запрос1.УстановитьПараметр("ДатаГрафика",ТекущаяДата());
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	
	ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи1.ДатаГрафика;
	КонецЦикла;
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если (РольДоступна("ASP_УправлениеЗаявкамиНаВывоз") ИЛИ РольДоступна("ПолныеПрава"))  Тогда
		Элементы.СтатусСклада.ТолькоПросмотр=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ФайловВложеноНажатие(Элемент, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",  Объект.Ссылка); 
	//ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
	ПараметрыФормы,
	// ПараметрыВыполненияКоманды.Источник,
	// ПараметрыВыполненияКоманды.Уникальность,
	// ПараметрыВыполненияКоманды.Окно
	);
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры
